Public Attributes | List of all members
API_PrimElement Union Reference
Drawing Primitives
A union containing all drawing primitives used with ACAPI_DrawingPrimitive_ShapePrims and ACAPI_LibraryPart_ShapePrims. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Prim_Head  | header
General primitive element header.
API_PrimPoint  | point
A primitive point.
API_PrimLine  | line
A primitive line.
API_PrimArc  | arc
A primitive arc.
API_PrimText  | text
A primitive text.
API_PrimPLine  | pline
A primitive polyline.
API_PrimTri  | tri
A primitive triangle.
API_PrimPoly  | poly
A primitive polygon.
API_PrimPict  | pict
A picture inside a placed drawing element.
API_CWallPanel  | panelKind
The curtain wall panel is window or door type.
Detailed Description
A union containing all drawing primitives used with ACAPI_DrawingPrimitive_ShapePrims and ACAPI_LibraryPart_ShapePrims.
Member Data Documentation
◆ arc
 API_PrimElement::arc
A primitive arc.
◆ header
 API_PrimElement::header
General primitive element header.
◆ line
 API_PrimElement::line
A primitive line.
◆ panelKind
 API_PrimElement::panelKind
The curtain wall panel is window or door type.
◆ pict
 API_PrimElement::pict
A picture inside a placed drawing element.
◆ pline
 API_PrimElement::pline
A primitive polyline.
◆ point
 API_PrimElement::point
A primitive point.
◆ poly
 API_PrimElement::poly
A primitive polygon.
◆ text
 API_PrimElement::text
A primitive text.
◆ tri
 API_PrimElement::tri
A primitive triangle.